Revit 2027 API
MechanicalUtils.ConnectDuctPlaceholdersAtTee(Document, Connector, Connector, Connector) Method
 Connects a trio of placeholders that can intersect in a Tee connection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ConnectDuctPlaceholdersAtTee(
	Document document,
	Connector connector1,
	Connector connector2,
	Connector connector3
)
Public Shared Function ConnectDuctPlaceholdersAtTee (
	document As Document,
	connector1 As Connector,
	connector2 As Connector,
	connector3 As Connector
) As Boolean
public:
static bool ConnectDuctPlaceholdersAtTee(
	Document^ document,
	Connector^ connector1,
	Connector^ connector2,
	Connector^ connector3
)
static member ConnectDuctPlaceholdersAtTee :
        document : Document *
        connector1 : Connector *
        connector2 : Connector *
        connector3 : Connector -> bool
Parameters
document Document
 The document.
connector1 Connector
 The end connector of the first placeholder.
connector2 Connector
 The end connector of second placeholder.
connector3 Connector
 The end connector of the third placeholder.
Return Value
Boolean
 True if connection succeeds, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The owner of connector is not duct placeholder. -or- The owners of connectors belong to different types of system. -or- The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end.
ArgumentNullException |  A non-optional argument was null
Remarks
 The three placeholders may or may not have physical connections. However, the first connector should be collinear with the second connector, and the third connector must have be able to be extended to have an intersection with first and second.
If first placeholder and second placeholder have the same size, the second one is merged with first one and original placeholder element will become invalid. If connection fails, the placeholders cannot be physically connected.
See Also
Reference
MechanicalUtils Class
ConnectDuctPlaceholdersAtTee Overload
Autodesk.Revit.DB.Mechanical Namespace